# Brewfile for Dotfiles
# This file is managed by dotfiles - https://github.com/sharosoo/dotfile
#
# Install with: brew bundle

# Core Tools
brew "git"
brew "curl"
brew "wget"
brew "jq"
brew "htop"
brew "tree"

# Modern CLI Tools
brew "eza"          # Modern replacement for ls
brew "bat"          # Cat with syntax highlighting
brew "fish"         # Fish shell
brew "ripgrep"      # Fast grep alternative
brew "fd"           # Fast find alternative
brew "fzf"          # Fuzzy finder
brew "zoxide"       # Smart cd command
brew "tldr"         # Simplified man pages
brew "dust"         # Modern du
brew "duf"          # Modern df
brew "procs"        # Modern ps
brew "sd"           # Modern sed
brew "httpie"       # Modern curl

# Development Tools
brew "neovim"
brew "tmux"
brew "gh"           # GitHub CLI
brew "glab"         # GitLab CLI
brew "hub"          # Another GitHub CLI tool
brew "lazygit"      # Terminal UI for git
brew "tig"          # Text interface for git
brew "diff-so-fancy" # Better git diffs

# Language Support
brew "python@3.12"
brew "pypy3"
brew "node"
brew "volta"
brew "go"
brew "rust"
brew "luajit"
brew "ruby"

# Database Tools
brew "postgresql@16", restart_service: false
brew "mysql", restart_service: false
brew "redis", restart_service: false
brew "sqlite"

# Cloud Tools
brew "awscli"
brew "azure-cli"
brew "doctl"        # DigitalOcean CLI

# Container Tools
brew "docker"
brew "docker-compose"
brew "kubectl"
brew "helm"
brew "minikube"

# Security Tools
brew "gnupg"
brew "pass"
brew "openssh"
brew "openssl"

# System Tools
brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "gnu-tar"
brew "gawk"
brew "watch"
brew "entr"         # Run commands when files change
brew "direnv"       # Environment switcher

# Network Tools
brew "nmap"
brew "telnet"
brew "mtr"
brew "iperf3"

# Archive Tools
brew "p7zip"
brew "unar"
brew "unzip"

# Media Tools
brew "ffmpeg"
brew "imagemagick"
brew "youtube-dl"

# Fonts
cask "font-d2coding-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"

# Applications (Optional - Comment out if not needed)
# cask "visual-studio-code"
# cask "iterm2"
# cask "warp"
# cask "docker"
# cask "postman"
# cask "insomnia"
# cask "tableplus"
